{
    "pagination": {
        "limit": 100,
        "offset": 0,
        "count": 100,
        "total": 10000
    },
    "data": [
        {
            "author": "Omaid Homayun, Contributor",
            "title": "How The Training App, Future, Has Cracked The Code Of Fitness",
            "description": "Future has developed a platform that makes having world-class personal training virtually accessible to anyone, anywhere. CEO and co-founder, Rishi Mandal, shares the importance of building a solution like this and key life and career lessons through his journey.",
            "url": "https://www.forbes.com/sites/omaidhomayun/2023/04/16/how-the-training-app-future-has-cracked-the-code-of-fitness/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643b8b78ee108455defe5714/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T19:46:35+00:00"
        },
        {
            "author": "Adetola Bademosi",
            "title": "2023 Census: We’ll count IDPs in Benue, other states— NPC",
            "description": "Tribune Online2023 Census: We&#8217;ll count IDPs in Benue, other states— NPCThe 2023 population and housing census will count International Displaced Persons (IDPs) in Benue State, the National Population Commission (NPC) has said. It is responding to the Benue State Governor, Samuel Ortom, and the President of Middle Belt Forum, Dr. Bitrus Pogu, calls on the Federal Government to postpone the 2023 Population and Housing Census [&#8230;]2023 Census: We&#8217;ll count IDPs in Benue, other states— NPCTribune Online",
            "url": "https://tribuneonlineng.com/2023-census-well-count-idps-in-benue-other-states-npc/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T19:32:57+00:00"
        },
        {
            "author": "Clement Idoko",
            "title": "Election Tribunal: Serve justice with all sense of openness, Judiciary urged",
            "description": "Tribune OnlineElection Tribunal: Serve justice with all sense of openness, Judiciary urgedJust as hearing has commenced at the election tribunal, a group, Transparency Advocacy For Development Initiative (TADI), has called on the judiciary to restore the hope and prayers of the Nigerian masses in the courts as the last hope of the common man. Executive Director, TADI, Amb. Yomi David said this during the weekend in [&#8230;]Election Tribunal: Serve justice with all sense of openness, Judiciary urgedTribune Online",
            "url": "https://tribuneonlineng.com/election-tribunal-serve-justice-with-all-sense-of-openness-judiciary-urged/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T19:22:55+00:00"
        },
        {
            "author": "Olayinka Olukoya",
            "title": "Gunmen kidnap traffic official on Lagos -Ibadan expressway",
            "description": "Tribune OnlineGunmen kidnap traffic official on Lagos -Ibadan expresswayA traffic official with the Ogun State Traffic Compliance and Enforcement Corps (TRACE), identified as Popoola Olasupo, has been reportedly abducted by suspected kidnappers, on Sunday morning, on the Lagos -Ibadan expressway. The traffic officer and his colleague were said to have been on their way to an assignment at about 6.30am, when the incident [&#8230;]Gunmen kidnap traffic official on Lagos -Ibadan expresswayTribune Online",
            "url": "https://tribuneonlineng.com/gunmen-kidnap-traffic-official-on-lagos-ibadan-expressway/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T18:42:37+00:00"
        },
        {
            "author": "Olakunle Moroof",
            "title": "My victory ordained by God Almighty — Tambuwal",
            "description": "Tribune OnlineMy victory ordained by God Almighty — TambuwalSokoto State Governor, Aminu Waziri Tambuwal, has described his electoral victory at the just concluded Senatorial Election as one ordained by God.  The governor, however dedicated his victory in the election to God and the people of the Sokoto South Senatorial district. Tambuwal while speaking with journalists shortly after his declaration as the Senator elect [&#8230;]My victory ordained by God Almighty — TambuwalTribune Online",
            "url": "https://tribuneonlineng.com/my-victory-ordained-by-god-almighty-tambuwal/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T18:30:12+00:00"
        },
        {
            "author": "Terna Chikpa",
            "title": "Supplementary Poll: APC’s Mark wins reps re-run in Taraba",
            "description": "Tribune OnlineSupplementary Poll: APC&#8217;s Mark wins reps re-run in TarabaThe independent national electoral Commision (INEC), has declared Hon. Mark Bako Useni of the All Progressives Congress (APC), as winner of supplementary election for Takum Donga and Ussa federal constituency. Hon. Useni scored 25929 votes to defeat the incumbent Riman Shaulu of the New Nigeria People&#8217;s Party NNPP who pulled 25350 votes while Hon. Instifanus Gbana of the People&#8217;s [&#8230;]Supplementary Poll: APC&#8217;s Mark wins reps re-run in TarabaTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-poll-apcs-mark-wins-reps-re-run-in-taraba/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T18:22:32+00:00"
        },
        {
            "author": "Adeyemo Adeolu",
            "title": "Gani Adams-led OPC faction appoints MSC holder as new Coordinator in Osun",
            "description": "Tribune OnlineGani Adams-led OPC faction appoints MSC holder as new Coordinator in OsunOsun state chapter of the Oodua People&#8217;s Congress(OPC) has appointed the erstwhile secretary of the group in the state,Comrade Aboderin Adeyemi Emmanuel as the new coordinator of the state. Adeyemi,is a Masters Degree holder (MSC)Political Science,Obafemi Awolowo University,Ile Ife,Osun state. Adeyemi&#8217;s appointment as the new coordinator of the state was unanimously confirmed by the highest [&#8230;]Gani Adams-led OPC faction appoints MSC holder as new Coordinator in OsunTribune Online",
            "url": "https://tribuneonlineng.com/gani-adams-led-opc-faction-appoints-msc-holder-as-new-coordinator-in-osun/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T18:18:18+00:00"
        },
        {
            "author": "Michael Ovat",
            "title": "Population census: Anambra council boss asks communities to assist enumerators",
            "description": "Tribune OnlinePopulation census: Anambra council boss asks communities to assist enumeratorsAs the 2023 National Population Commission’s census exercise draws nearer, the Transition Committee Chairman for Orumba South Local Government Area of Anambra State, Prince Neville Uchendu has called on the people of the fifteen communities in Orumba South to give necessary support and assistance to the population census enumeration officials and other adhoc staff in [&#8230;]Population census: Anambra council boss asks communities to assist enumeratorsTribune Online",
            "url": "https://tribuneonlineng.com/population-census-anambra-council-boss-asks-communities-to-assist-enumerators/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T18:05:50+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "FLASHBACK: I’ll support Yahaya Bello’s decision whether good or bad — Smart Adeyemi",
            "description": "Tribune OnlineFLASHBACK: I&#8217;ll support Yahaya Bello&#8217;s decision whether good or bad — Smart AdeyemiSenator representing Kogi West, Smart Adeyemi in an old video was quoted expressing his resolve to support Governor Yahaya Bello through thick and thin. This comes on the heels of the just concluded All Progressives Congress (APC) primary election in the State where Yahaya Bello&#8217;s preferred candidate, Ahmed Usman Ododo was declared winner of the [&#8230;]FLASHBACK: I&#8217;ll support Yahaya Bello&#8217;s decision whether good or bad — Smart AdeyemiTribune Online",
            "url": "https://tribuneonlineng.com/flashback-ill-support-yahaya-bellos-decision-whether-good-or-bad-smart-adeyemi/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T17:57:01+00:00"
        },
        {
            "author": "Our Reporter",
            "title": "If your wife is sleeping around, forgive, pray for her — Bukunmi Oluwasina",
            "description": "Tribune OnlineIf your wife is sleeping around, forgive, pray for her — Bukunmi OluwasinaPopular Nollywood actress, Bukunmi Oluwasina has advised men to forgive and pray for their spouse who sleeps around with other men. She made this known in a video posted on her Instagram page, where she said everyone keeps advising women and leaving the men out. She captioned, “If your wife is sleeping around, forgive and [&#8230;]If your wife is sleeping around, forgive, pray for her — Bukunmi OluwasinaTribune Online",
            "url": "https://tribuneonlineng.com/if-your-wife-is-sleeping-around-forgive-pray-for-her-bukunmi-oluwasina/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T17:38:39+00:00"
        },
        {
            "author": "Ebiowei Lawal",
            "title": "Bayelsa guber: I’m willing to work with Lyon, Maciver, others — APC candidate, Sylva",
            "description": "Tribune OnlineBayelsa guber: I&#8217;m willing to work with Lyon, Maciver, others — APC candidate, SylvaThe candidate of the All Progressives Congress (APC) in the forthcoming 2023 Governorship Election in Bayelsa State, Chief Timipre Sylva, has expressed willingness to work with his contenders during the just concluded governorship primary where he emerged winner. Chief Sylva in a statement signed by his Special Assistant on Media And Public Affairs, Mr. Julius [&#8230;]Bayelsa guber: I&#8217;m willing to work with Lyon, Maciver, others — APC candidate, SylvaTribune Online",
            "url": "https://tribuneonlineng.com/bayelsa-guber-im-willing-to-work-with-lyon-maciver-others-apc-candidate-sylva/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T17:17:15+00:00"
        },
        {
            "author": "Leon Usigbe",
            "title": "Adamawa poll crisis: Only Fintiri’s declaration will ensure peace — PDP",
            "description": "Tribune OnlineAdamawa poll crisis: Only Fintiri&#8217;s declaration will ensure peace — PDPLeon Usigbe, Abuja The Peoples Democratic Party (PDP) has warned that crisis in Adamawa State can only be averted with the declaration of the candidate of the party, Governor Ahmadu Fintiri, who it says is the true winner of the gubernatorial election. Addressing a press conference at the national secretariat of the party in Abuja [&#8230;]Adamawa poll crisis: Only Fintiri&#8217;s declaration will ensure peace — PDPTribune Online",
            "url": "https://tribuneonlineng.com/adamawa-poll-crisis-only-fintiris-declaration-will-ensure-peace-pdp/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T17:11:29+00:00"
        },
        {
            "author": "Soji Ajibola",
            "title": "Police arrest kidnap kingpin, 28 other suspects in Oyo",
            "description": "Tribune OnlinePolice arrest kidnap kingpin, 28 other suspects in OyoPolice have confirmed the arrest of a kidnap kingpin after a foiled attempt and 28 other suspects for various criminal activities in Oyo state. The suspected kidnapper (name withheld) was alleged to have written a threat letter to his victim, demanding for N15m ransom. Disclosing this to newsmen during the parade of the suspect at [&#8230;]Police arrest kidnap kingpin, 28 other suspects in OyoTribune Online",
            "url": "https://tribuneonlineng.com/police-arrest-kidnap-kingpin-28-other-suspects-in-oyo/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T17:01:08+00:00"
        },
        {
            "author": "Soji Ajibola",
            "title": "Police nab 28-year-old cleric over alleged assault, threat to life in Oyo",
            "description": "Tribune OnlinePolice nab 28-year-old cleric over alleged assault, threat to life in OyoPolice have arrested and arraigned a 28 years old cleric Ahmed Atilade at the Magistrate court over alleged assault and threat to life its officers whilst on official duty. The Police Public Relations Officer, Adewale Osifeso disclosed in a statement that the cleric in flagrant abuse of traffic law allegedly assaulted the police officers on [&#8230;]Police nab 28-year-old cleric over alleged assault, threat to life in OyoTribune Online",
            "url": "https://tribuneonlineng.com/police-nab-28-year-old-cleric-over-alleged-assault-threat-to-life-in-oyo/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:54:12+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Kogi 2023: Arch Isa picks APM guber ticket",
            "description": "Tribune OnlineKogi 2023: Arch Isa picks APM guber ticketArch Dauda Isah has emerged as the governorship Candidate of Allied Peoples&#8217; Movement, (APM) in Kogi State. Arch Isah who was a consensus candidate of the party scored 69 votes to emerged the flagbearer of APM. The primary election was held at APM Secretariat in Lokoja with the presence of heavy security. The election was monitored [&#8230;]Kogi 2023: Arch Isa picks APM guber ticketTribune Online",
            "url": "https://tribuneonlineng.com/kogi-2023-arch-isa-picks-apm-guber-ticket/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:49:46+00:00"
        },
        {
            "author": "Rebecca Fraser-Thill, Senior Contributor",
            "title": "Is It Time To Take A Sabbatical From Work?",
            "description": "The difference between people who thrive during a planned sabbatical and those who struggle is how thoroughly they’ve thought through four considerations.",
            "url": "https://www.forbes.com/sites/rebeccafraserthill/2023/04/16/is-it-time-to-take-a-sabbatical-from-work/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643c1a05ab99f68c920ab186/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:35:22+00:00"
        },
        {
            "author": "Dayo Ayeyemi",
            "title": "Fire outbreak at Queens College in Lagos",
            "description": "Tribune OnlineFire outbreak at Queens College in LagosThere was a fire outbreak at Queens College in the Yaba area of Lagos state. The fire, according to the Director of Lagos State Fire and Rescue Service, Margaret Adeseye, started in a two-room boys’ quarter located behind the Staff quarters of the all-girls school. Adeseye, who confirmed the incident, said the two-room was being [&#8230;]Fire outbreak at Queens College in LagosTribune Online",
            "url": "https://tribuneonlineng.com/fire-outbreak-at-queens-college-in-lagos/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:21:25+00:00"
        },
        {
            "author": "MeiMei Fox, Contributor",
            "title": "10 Tips For Making It As A Comedian From Sarah Halstead",
            "description": "In just a few years since moving to LA to make it as an actor-comedian, Sarah Halstead has a comedy special on Netflix, a monthly gig at the Hollywood Improv, a successful podcast, and regular acting engagements. Here, she shares her story and tongue-in-cheek advice for pursuing your life purpose.",
            "url": "https://www.forbes.com/sites/meimeifox/2023/04/16/10-tips-for-making-it-as-a-comedian-from-sarah-halstead/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643adc5811f8fdb552fe5712/0x0.jpg?width=960&precrop=482%2C361%2Cx0%2Cy68",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:15:00+00:00"
        },
        {
            "author": "Oluwole Ige",
            "title": "I won’t take my appointment for granted — LAUTECH Chancellor, Awuse",
            "description": "Tribune OnlineI won&#8217;t take my appointment for granted — LAUTECH Chancellor, AwuseThe newly appointed Chancellor of the Ladoke Akintola University of Technology (LAUTECH), Ogbomoso, Oyo State, His Royal Majesty, Ohna Sergeant Chidi Awuse, has said that he would not take his appointment by Governor Seyin Makinde for granted. He lauded the governor for finding him worthy of the appointment, just as he vowed to deploy his [&#8230;]I won&#8217;t take my appointment for granted — LAUTECH Chancellor, AwuseTribune Online",
            "url": "https://tribuneonlineng.com/i-wont-take-my-appointment-for-granted-lautech-chancellor-awuse/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:08:17+00:00"
        },
        {
            "author": "Alex Adedamola",
            "title": "INEC Declares Nasiru Idris Of APC Winner Of Kebbi Guber Poll",
            "description": "The All Progressives Congress (APC) candidate Nasiru Idris, has been declared the winner of the 2023 governorship election in Kebbi State. Idris was declared the winner by the Returning Officer for Kebbi State on Sunday in Birnin Kebbi, the state capital. READ MORE: Controversy As Wrong INEC Official Declares Binani Winner Of Adamawa Governor Poll He [&#8230;]The post INEC Declares Nasiru Idris Of APC Winner Of Kebbi Guber Poll appeared first on Information Nigeria.",
            "url": "https://www.informationng.com/2023/04/inec-declares-nasiru-idris-of-apc-winner-of-kebbi-guber-poll.html",
            "source": "Information Nigeria",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T16:00:02+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Two governorship candidates emerge in Kogi ADC",
            "description": "Tribune OnlineTwo governorship candidates emerge in Kogi ADCThe crisis rocking the Kogi State Chapter of the African Democratic Congress (ADC) took a new dimension as two factions have produced different candidates for the November Governorship Election in the State. The candidates are Dele Williams who emerged at a State Congress under the leadership of the Ogga Kingsley Temitope faction as the ADC [&#8230;]Two governorship candidates emerge in Kogi ADCTribune Online",
            "url": "https://tribuneonlineng.com/two-governorship-candidates-emerge-in-kogi-adc/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T15:56:28+00:00"
        },
        {
            "author": "Idahosa Moses",
            "title": "Edo: Community protests as monarch rules from London",
            "description": "Tribune OnlineEdo: Community protests as monarch rules from LondonThe people of Odighi Village in Ovia North East Local government Area of Edo State have kicked against the alleged overseeing of affairs of the village from abroad by the Enogie (Duke), HRH. Osaretin Akenzua. Mr Andrew Amayo, the third most elderly man (Ozukpogieha) in the Village stated this on behalf of the people during [&#8230;]Edo: Community protests as monarch rules from LondonTribune Online",
            "url": "https://tribuneonlineng.com/edo-community-protests-as-monarch-rules-from-london/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T15:54:05+00:00"
        },
        {
            "author": "Sunday Ejike",
            "title": "NDLEA intercepts drug consignments in winter jackets, body lotion at Lagos airport",
            "description": "Tribune OnlineNDLEA intercepts drug consignments in winter jackets, body lotion at Lagos airportThe National Drug Law Enforcement Agency (NDLEA) has intercepted consignments of Tramadol, Rohypnol, Ecstasy (Designer drug) and cannabis concealed in winter jackets and bottles of body cream at the Lagos International. A statement by the spokesman of the NDLEA, Mr. Femi Babafemi on Sunday said, the psychoactive substances were recovered at the new terminal of [&#8230;]NDLEA intercepts drug consignments in winter jackets, body lotion at Lagos airportTribune Online",
            "url": "https://tribuneonlineng.com/ndlea-intercepts-drug-consignments-in-winter-jackets-body-lotion-at-lagos-airport/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T15:34:58+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "TRENDING: 25% votes in FCT mandatory — Ex-INEC REC",
            "description": "Tribune OnlineTRENDING: 25% votes in FCT mandatory — Ex-INEC RECFormer Resident Electoral Commissioner (REC) for the Independent National Electoral Commission (INEC) in Akwa Ibom, Mike Igini, in a now-viral video was quoted saying Nigeria’s Constitution mandated a candidate to score 25 percent of the Federal Capital Territory (FCT) before being declared winner in presidential poll. Recall many Nigerians had interpreted the relevant section of [&#8230;]TRENDING: 25% votes in FCT mandatory — Ex-INEC RECTribune Online",
            "url": "https://tribuneonlineng.com/trending-25-votes-in-fct-mandatory-ex-inec-rec/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T15:30:15+00:00"
        },
        {
            "author": "Ishola Michael",
            "title": "One killed, 64 houses razed in Bauchi coronation clash",
            "description": "Tribune OnlineOne killed, 64 houses razed in Bauchi coronation clashOne person has been confirmed killed, another seriously injured while not fewer than 64 houses were razed following a communal clash in Sang village of Bogoro LGA in Bauchi state. Also, properties worth millions of Naira were utterly destroyed in the process. Reports available revealed that the incident took place on Saturday over a coronation [&#8230;]One killed, 64 houses razed in Bauchi coronation clashTribune Online",
            "url": "https://tribuneonlineng.com/one-killed-64-houses-razed-in-bauchi-coronation-clash/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T15:17:36+00:00"
        },
        {
            "author": "Hakeem Gbadamosi",
            "title": "Court deposes first class monarch in Ondo five years after installation",
            "description": "Tribune OnlineCourt deposes first class monarch in Ondo five years after installationThe High Court sitting in Akure, Ondo state capital, has sacked the traditional of Oke-Igbo in the Ile-Oluji/Oke-Igbo Local Government of Ondo State, the Olu-Oke of Oke-Igbo, Oba Lawrence Oluwole Babajide, after five years on the throne. In the judgment by Justice Ademola Enikuemehin, the court ruled that the deposed traditional ruler is not a [&#8230;]Court deposes first class monarch in Ondo five years after installationTribune Online",
            "url": "https://tribuneonlineng.com/court-deposes-first-class-monarch-in-ondo-five-years-after-installation/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T14:41:42+00:00"
        },
        {
            "author": "Leon Usigbe",
            "title": "Adamawa: Disregard purported APC declaration – PDP reacts",
            "description": "Tribune OnlineAdamawa: Disregard purported APC declaration – PDP reactsThe Peoples Democratic Party (PDP) has called on the people of Adamawa State, Nigerians and the International Community to disregard the purported declaration of the candidate of the All Progressives Congress (APC), Senator Aisha Dahiru, (Binani, as winner of the Adamawa State governorship election. The call was contained in a statement issued on Sunday by [&#8230;]Adamawa: Disregard purported APC declaration – PDP reactsTribune Online",
            "url": "https://tribuneonlineng.com/adamawa-disregard-purported-apc-declaration-pdp-reacts/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T14:35:57+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "Buhari meets APC Governors, others in Makkah",
            "description": "Tribune OnlineBuhari meets APC Governors, others in MakkahPresident Muhammadu Buhari on the fifth day of the official visit to the Kingdom of Saudi Arabia, shared a warm moment with Governors of Borno and Yobe, Prof. Babagana Zulum and Mai Mala Buni as well as Katsina State Governor-elect, Dikko Radda. The News Agency of Nigeria (NAN) reports that the Nigerian leader also received [&#8230;]Buhari meets APC Governors, others in MakkahTribune Online",
            "url": "https://tribuneonlineng.com/buhari-meets-apc-governors-others-in-makkah/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T14:14:29+00:00"
        },
        {
            "author": "Dr. Gleb Tsipursky, Contributor",
            "title": "The Hidden Driver Behind Rising House Prices? Remote Work!",
            "description": "While many argue that remote work has led to a decline in demand for big city living, a recent paper by the Economic Innovation Group, titled \"Remote Work and Household Formation,\" unveils the hidden factor driving up house prices: remote and hybrid work.",
            "url": "https://www.forbes.com/sites/glebtsipursky/2023/04/16/the-hidden-driver-behind-rising-house-prices-remote-work/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643b3d06fa85090a793bf6f9/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T14:12:33+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Kogi: APC wins Dekina/Bassa Federal Constituency supplementary poll",
            "description": "Tribune OnlineKogi: APC wins Dekina/Bassa Federal Constituency supplementary pollThe All Progressives Congress, (APC), has won the supplementary election held Saturday for Dekina Bassa Federal Constituency, of Kogi State. The candidate of the APC, Hon. Paul Haruna polled 25,610 votes to defeat his closest rival, Okai Austin of the Peoples Democratic Party (PDP) who polled 11,621. The results of the election were announced by [&#8230;]Kogi: APC wins Dekina/Bassa Federal Constituency supplementary pollTribune Online",
            "url": "https://tribuneonlineng.com/kogi-apc-wins-dekina-bassa-federal-constituency-supplementary-poll/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T14:05:28+00:00"
        },
        {
            "author": "Mohammed Sabiu",
            "title": "PDP agent calls for arrest of Adamawa REC",
            "description": "Tribune OnlinePDP agent calls for arrest of Adamawa RECThe Peoples Democratic Party (PDP) governorship agent in Adamawa state, Idi Hong has called for the immediate arrest of the Resident Electoral Commissioner (REC), Ari Hudu, over the announcement of results when the collation of results is still ongoing. The party&#8217;s agent made the call after Hudu declared Senator Aisha Dahiru, (Binani) the winner of [&#8230;]PDP agent calls for arrest of Adamawa RECTribune Online",
            "url": "https://tribuneonlineng.com/pdp-agent-calls-for-arrest-of-adamawa-rec/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T13:51:46+00:00"
        },
        {
            "author": "William Arruda, Senior Contributor",
            "title": "How To Write A Captivating Digital Bio",
            "description": "To deliver something that’s authentic and compelling and will lead a decision maker to want to know you better, do this: Double down on the human elements.",
            "url": "https://www.forbes.com/sites/williamarruda/2023/04/16/how-to-write-a-captivating-digital-bio/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643bf55c2ab89b7a020ab186/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T13:32:00+00:00"
        },
        {
            "author": "Adamu Amadu",
            "title": "Supplementary Election: APC retains Gumel Fed Constituency, 2 HoA seats in Jigawa",
            "description": "Tribune OnlineSupplementary Election: APC retains Gumel Fed Constituency, 2 HoA seats in JigawaThe Independent National Electoral Commission (INEC) has declared the candidate of the All Progressives Congress (APC), as the winner of Saturday’s supplementary election for Gumel-Gagarawa-Suletankar-Maigatari-Suletankar-Maigatari-Maigatari federal constituency in Jigawa. Sani who won the election for his second term scored 49,893 votes after Saturday&#8217;s Supplementary elections. Prof. Ahmed Baita, the INEC Returning Officer in Gumel announced [&#8230;]Supplementary Election: APC retains Gumel...",
            "url": "https://tribuneonlineng.com/supplementary-election-apc-retains-gumel-fed-constituency-2-hoa-seats-in-jigawa/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T12:39:03+00:00"
        },
        {
            "author": "Suyi Ayodele",
            "title": "Edo 2024: Esan group outlines criteria for endorsing aspirants",
            "description": "Tribune OnlineEdo 2024: Esan group outlines criteria for endorsing aspirantsThe Esan ethnic nationality of Edo State has listed the parameters it would consider in supporting any aspirant for the position of governor for the state in the 2024 governorship election in the state. The ethnic group from the Edo Central Senatorial District, said any candidate that would enjoy its support for the election, must [&#8230;]Edo 2024: Esan group outlines criteria for endorsing aspirantsTribune Online",
            "url": "https://tribuneonlineng.com/edo-2024-esan-group-outlines-criteria-for-endorsing-aspirants/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T12:30:38+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "Bayelsa/Imo guber: Diri will retain seat, Uzodinma may lose if… – Primate Ayodele",
            "description": "Tribune OnlineBayelsa/Imo guber: Diri will retain seat, Uzodinma may lose if&#8230; – Primate AyodeleThe leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has revealed that the Bayelsa State Governor, Douye Diri will retain his seat in the governorship election while a strong opposition will unseat his Imo counterpart, Hope Uzodinma. The cleric in a statement signed Sunday by his media aide, Osho Oluwatosin, advised the Bayelsa governor [&#8230;]Bayelsa/Imo guber: Diri will retain seat, Uzodinma may lose if&#8230; – Primate AyodeleTribune Online",
            "url": "https://tribuneonlineng.com/diri-will-retain-seat-uzodinma-may-lose-if-primate-ayodele/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T12:23:42+00:00"
        },
        {
            "author": "Kola Oyelere",
            "title": "‘Forgive me, I’ve forgiven those who wronged me’ – Ganduje begs for forgiveness",
            "description": "Tribune Online&#8216;Forgive me, I’ve forgiven those who wronged me&#8217; – Ganduje begs for forgivenessAs exit of governance knocked the door for outgoing Kano State governor, Abdullahi Ganduje begged for forgiveness from those he might have trampled in the course of his duty as number one citizen of the state. However, in a swift reaction to the purported plea of outgoing governor Ganduje, the former Commissioner for works and [&#8230;]&#8216;Forgive me, I’ve forgiven those who wronged me&#8217; – Ganduje begs for forgivenessTribune Online",
            "url": "https://tribuneonlineng.com/forgive-me-ive-forgiven-those-who-wronged-me-ganduje-begs-for-forgiveness/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T12:17:07+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "IPOB not threat to 2023 census in South East – NPC",
            "description": "Tribune OnlineIPOB not threat to 2023 census in South East – NPCOutlawed Indigenous People of Biafra (IPOB) will not be a threat to the 2023 national population and housing census scheduled from May 3 to May 5. Federal Commissioner of the National Population Commission (NPC) in Enugu State, Mr Ejike Eze, gave the assurance on Sunday in Enugu when he spoke with the News Agency of [&#8230;]IPOB not threat to 2023 census in South East – NPCTribune Online",
            "url": "https://tribuneonlineng.com/ipob-not-threat-to-2023-census-in-south-east-npc/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T12:02:04+00:00"
        },
        {
            "author": "Ebiowei Lawal",
            "title": "2023: Aggrieved aspirant rejects APC governorship primary results in Bayelsa",
            "description": "Tribune Online2023: Aggrieved aspirant rejects APC governorship primary results in BayelsaAn aggrieved aspirant in the just concluded Bayelsa State Governorship Primary Election of the All Progressives Congress (APC), Festus Daumiebi, has rejected what was announced as the result of the exercise. Daumiebi claimed that there was no election in the wards across the State as officials of the party who were sent to conduct the [&#8230;]2023: Aggrieved aspirant rejects APC governorship primary results in BayelsaTribune Online",
            "url": "https://tribuneonlineng.com/2023-aggrieved-aspirant-rejects-apc-governorship-primary-results-in-bayelsa/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T11:46:08+00:00"
        },
        {
            "author": "Olakunle Moroof",
            "title": "BREAKING: INEC declares Tambuwal Senator-elect for Sokoto South",
            "description": "Tribune OnlineBREAKING: INEC declares Tambuwal Senator-elect for Sokoto SouthThe Governor of Sokoto State, Aminu Tambuwal, was on Sunday morning declared the Senator-elect for Sokoto South Senatorial district. Tambuwal, the candidate of the Peoples Democratic Party (PDP) defeated the current serving Senator Danbaba Dambuwa, with a total margin of 4,976. Announcing the results at about 11:55am on Sunday at the INEC office in Bodinga [&#8230;]BREAKING: INEC declares Tambuwal Senator-elect for Sokoto SouthTribune Online",
            "url": "https://tribuneonlineng.com/breaking-inec-declares-tambuwal-senator-elect-for-sokoto-south/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T11:17:52+00:00"
        },
        {
            "author": "Adelowo Oladipo",
            "title": "NDE to register employed persons in Niger State",
            "description": "Tribune OnlineNDE to register employed persons in Niger StateThe National Directorate of Employment (NDE) has concluded plans to embark on registration of all unemployed persons in the 25 local government areas of Niger State. Niger State NDE Coordinator, Mallam Mohammed Abubakar in a statement issued in Minna, said the state registration is scheduled to start on Monday 17th April to 5th May 2023. [&#8230;]NDE to register employed persons in Niger StateTribune Online",
            "url": "https://tribuneonlineng.com/nde-to-register-employed-persons-in-niger-state/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T11:05:38+00:00"
        },
        {
            "author": "Sikiru Obarayese",
            "title": "BREAKING: INEC suspends Adamawa guber collation, declares REC’s action void",
            "description": "Tribune OnlineBREAKING: INEC suspends Adamawa guber collation, declares REC&#8217;s action voidThe Independent National Electoral Commission (INEC) has suspended the collation of results of Adamawa governorship supplementary elections after the Resident Electoral Commissioner (REC), Barrister Hudu Yunusa declared Senator Aisha Dahiru Binani of All Progressive Congress (APC) winner of the poll. The REC on Sunday morning without a figure declared Binani the winner of the supplementary [&#8230;]BREAKING: INEC suspends Adamawa guber collation, declares REC&#8217;s action voidTribune Online",
            "url": "https://tribuneonlineng.com/breaking-inec-suspends-adamawa-guber-collation-declares-recs-action-void/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T11:02:50+00:00"
        },
        {
            "author": "Adegbite Taoheed",
            "title": "BREAKING: Aisha Binani declared winner of Adamawa governorship election ",
            "description": "Tribune OnlineBREAKING: Aisha Binani declared winner of Adamawa governorship election Senator Aisha Dahiru Binani, candidate of the All Progressive Congress (APC) has been declared winner of the Adamawa governorship election. Binani was declared on Sunday morning by the Independent National Electoral Commission (INEC).  Barrister Hudu Yunusa, the Resident Electoral Commissioner for the state made the declaration following the supplementary election held Saturday. Details later…. READ [&#8230;]BREAKING: Aisha Binani declared winner of Adamawa governorship election Tribune Online",
            "url": "https://tribuneonlineng.com/breaking-aisha-binani-declared-winner-of-adamawa-governorship-election/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T10:07:37+00:00"
        },
        {
            "author": "Olakunle Moroof",
            "title": "JUST IN: INEC declares Abdulsamad Dasuki winner of Tambuwal/Kebbe Federal Constituency",
            "description": "Tribune OnlineJUST IN: INEC declares Abdulsamad Dasuki winner of Tambuwal/Kebbe Federal ConstituencyOlakunle Maruf, Sokoto The Independent National Electoral Commission has declared the candidate of the Peoples Democratic Party, PDP, Abdusamad Dasuki, as the winner of Kebbe/Tambuwal federal constituency in Sokoto State. Announcing the results on Sunday morning, the returning officer, Professor Abubakar Sidiq Muhammed, said the PDP candidate scored a total number of 47,317 votes to [&#8230;]JUST IN: INEC declares Abdulsamad Dasuki winner of Tambuwal/Kebbe Federal ConstituencyTribune Online",
            "url": "https://tribuneonlineng.com/just-in-inec-declares-abdulsamad-dasuki-winner-of-tambuwal-kebbe-federal-constituency/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T09:47:08+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Legal practitioner, Okeme wins Labour Party’s Kogi governorship ticket",
            "description": "Tribune OnlineLegal practitioner, Okeme wins Labour Party’s Kogi governorship ticketA legal practitioner and prominent businessman, Barrister Adejo Okeme has won the Labour party governorship ticket for Kogi election. Barrister Okeme polled 127 votes ahead of his closest rival, AVM Isaac Alfa who scored 69 votes at the primary held on Saturday in Lokoja, the state capital. Barrister Okeme is from Kogi East Senatorial district. [&#8230;]Legal practitioner, Okeme wins Labour Party’s Kogi governorship ticketTribune Online",
            "url": "https://tribuneonlineng.com/legal-practitioner-okeme-wins-labour-partys-kogi-governorship-ticket/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T09:35:40+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Kogi Guber: Leke Abejide emerges ADC’s sole candidate",
            "description": "Tribune OnlineKogi Guber: Leke Abejide emerges ADC&#8217;s sole candidateMember representing Yagba federal constituency, Hon Leke Abejide has emerged as the Kogi governorship candidate of the African Democratic Congress (ADC). The ADC primary which was held peacefully across the 239 wards of the 21 local government areas of the state had Collation centre at the Idri Nana Hotel, Lokoja. The direct primary election was [&#8230;]Kogi Guber: Leke Abejide emerges ADC&#8217;s sole candidateTribune Online",
            "url": "https://tribuneonlineng.com/kogi-guber-leke-abejide-emerges-adcs-sole-candidate/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T09:23:28+00:00"
        },
        {
            "author": "Mohammed Sabiu",
            "title": "Bandits kill 22 in Southern Kaduna fresh attack",
            "description": "Tribune OnlineBandits kill 22 in Southern Kaduna fresh attackBandits stormed Runji village in Zango Kataf local government area of Kaduna state and killed no fewer than 20 people during the attack. A resident of the area who pleaded for anonymity in an interview with newsmen disclosed that the hoodlums stormed the village around 9 pm on Saturday night when the villagers were indoors. [&#8230;]Bandits kill 22 in Southern Kaduna fresh attackTribune Online",
            "url": "https://tribuneonlineng.com/bandits-kill-22-in-southern-kaduna-fresh-attack/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T09:14:48+00:00"
        },
        {
            "author": "Tribune Online",
            "title": "Sudan unrest: Army, RSF battle over key sites, leaving 56 civilians dead",
            "description": "Tribune OnlineSudan unrest: Army, RSF battle over key sites, leaving 56 civilians deadAt least 56 civilians have been killed in cities and regions around the country, the Sudanese Doctors&#8217; Union have said. It added that 595 people, including combatants, had been wounded since the fighting erupted on Saturday with dozens of military personnel dead, and some still being treated in hospitals. Reuters reports heavy artillery firing across [&#8230;]Sudan unrest: Army, RSF battle over key sites, leaving 56 civilians deadTribune Online",
            "url": "https://tribuneonlineng.com/sudan-unrest-army-rsf-battle-over-key-sites-leaving-56-civilians-dead/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T08:34:49+00:00"
        },
        {
            "author": "Femi Akinyemi",
            "title": "Gunmen kill 7, including child in Mexican resort",
            "description": "Tribune OnlineGunmen kill 7, including child in Mexican resortMexican authorities said armed men on Saturday killed a child and six others in a resort in the central Mexican state of Guanajuato. The Guanajuato region has been increasingly plagued by drug cartel violence. A local news site Debate Noticias, released a footage taken by an eye-witness at the scene, showing the victims after the [&#8230;]Gunmen kill 7, including child in Mexican resortTribune Online",
            "url": "https://tribuneonlineng.com/gunmen-kill-7-including-child-in-mexican-resort/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T08:12:38+00:00"
        },
        {
            "author": "Michael Ovat",
            "title": "Supplementary poll: LP’s Ogene wins reps seat in Anambra",
            "description": "Tribune OnlineSupplementary poll: LP&#8217;s Ogene wins reps seat in AnambraLabour Party (LP) candidate for Ogbaru federal constituency of Anambra, Hon. Victor Afam Ogene has been declared winner of the constituency poll. He was declared winner by the Returning officer, Dr Kingsley Ubaorji, a lecturer at the Nnamdi Azikiwe University (UNIZIK), Awka, after Saturday supplementary election conducted in 45 polling units in the federal constituency. [&#8230;]Supplementary poll: LP&#8217;s Ogene wins reps seat in AnambraTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-poll-lps-ogene-wins-reps-seat-in-anambra/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T07:37:04+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "PDP primary: Former Kogi deputy gov rejects proposed delegate list",
            "description": "Tribune OnlinePDP primary: Former Kogi deputy gov rejects proposed delegate listFormer Kogi Deputy Governor and leading aspirant in PDP primary election, Yomi Awoniyi, has rejected the proposed delegate list to be used for today (Sunday) election. Awoniyi said any effort to use the unapproved delegate list would be rejected. Awoniyi who made this known in a press conference held in Lokoja disclosed that there are [&#8230;]PDP primary: Former Kogi deputy gov rejects proposed delegate listTribune Online",
            "url": "https://tribuneonlineng.com/pdp-primary-former-kogi-deputy-gov-rejects-proposed-delegate-list/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T07:18:12+00:00"
        },
        {
            "author": "Kola Oyelere",
            "title": "Supplementary poll: Doguwa clinches Reps seat for 5th term",
            "description": "Tribune OnlineSupplementary poll: Doguwa clinches Reps seat for 5th termEmbattled majority leader, House of Representatives, Hon. Alhasan Ado Doguwa, has finally been declared winner of Tudunwada/ Doguwa Federal Constituency, for record fifth term. It be recalled that February election was declared inconclusive in the constituency due to violence and over voting. Also, the Returning Officer for the election on February 25, Ibrahim Adamu Yakasai, [&#8230;]Supplementary poll: Doguwa clinches Reps seat for 5th termTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-poll-doguwa-clinches-reps-seat-for-5th-term/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T07:03:19+00:00"
        },
        {
            "author": "Gus Alexiou, Contributor",
            "title": "E-Scooters Often Hired By Disabled Riders To Combat Pain And Fatigue, Survey Shows",
            "description": "Contrary to the belief in some circles that rented urban e-scooters are nothing more than a hazard to pedestrians with disabilities – new survey data has revealed that people with certain disabilities are amongst the main groups regularly taking the micro-mobility devices out for a spin.",
            "url": "https://www.forbes.com/sites/gusalexiou/2023/04/16/e-scooters-often-hired-by-disabled-riders-to-combat-pain-and-fatigue-survey-shows/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643b08319f2b81b8150ab186/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T07:00:00+00:00"
        },
        {
            "author": "Olakunle Moroof",
            "title": "JUST IN: Wamakko returns to Senate, defeats Sokoto deputy governor ",
            "description": "Tribune OnlineJUST IN: Wamakko returns to Senate, defeats Sokoto deputy governor Former Governor of Sokoto and the candidate of the All Progressive Congress, Aliyu Magatakarda Wamakko, has been declared winner of the Sokoto North Senatorial election. Wamakko defeated his closest opponent, the state deputy governor, Manir Muhammad Dan&#8217;Iya, the candidate of the Peoples Democratic Party with a margin of 23,023 votes. Announcing the results early on [&#8230;]JUST IN: Wamakko returns to Senate, defeats Sokoto deputy governor Tribune Online",
            "url": "https://tribuneonlineng.com/just-in-wamakko-returns-to-senate-defeats-sokoto-deputy-governor/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T06:49:59+00:00"
        },
        {
            "author": "Sandra Nwaokolo",
            "title": "Police arrest suspects in connection with alleged Tiwa Savage kidnap attempt",
            "description": "Tribune OnlinePolice arrest suspects in connection with alleged Tiwa Savage kidnap attemptThe Nigeria Police Force Criminal Investigation Department in Alagbon, Lagos, has announced the arrest of several individuals allegedly involved in an attempt to kidnap Nigerian musician Tiwa Savage. CSP Oluniyi Ogundeyi, the department&#8217;s spokesperson, confirmed this to the News Agency of Nigeria (NAN) on Friday in Lagos. According to reports, the news of the attempted [&#8230;]Police arrest suspects in connection with alleged Tiwa Savage kidnap attemptTribune Online",
            "url": "https://tribuneonlineng.com/police-arrest-suspects-in-connection-with-alleged-tiwa-savage-kidnap-attempt/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T06:41:33+00:00"
        },
        {
            "author": "Sandra Nwaokolo",
            "title": "NYSC distances self from ex-corper arraigned for alleged fraud in Oyo",
            "description": "Tribune OnlineNYSC distances self from ex-corper arraigned for alleged fraud in OyoThe National Youth Service Corps (NYSC) has distanced itself from an ex-corper, Ukanwa Ikechukwu, who was recently arraigned at the Iyaganku Magistrate’s Court in Oyo State over an alleged N235,000 fraud committed against a police officer. In a statement released by the Director of Press and Public Relations of the NYSC, Eddy Megwa, the management [&#8230;]NYSC distances self from ex-corper arraigned for alleged fraud in OyoTribune Online",
            "url": "https://tribuneonlineng.com/nysc-distances-self-from-ex-corper-arraigned-for-alleged-fraud-in-oyo/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T06:37:15+00:00"
        },
        {
            "author": "Johnkennedy Uzoma",
            "title": "Senator Achonu emerges LP guber candidate in Imo",
            "description": "Tribune OnlineSenator Achonu emerges LP guber candidate in ImoAthan Achonu, a former senator of Okigwe zone (Imo North) has emerged the candidate of the Labour Party (LP) for the November 11th Imo governorship election. While announcing the result of the primary election held at the Library Event centre, Owerri on Saturday, the Returning Officer of the election, Barr. Calistus Ihejiagwa said Achonu polled [&#8230;]Senator Achonu emerges LP guber candidate in ImoTribune Online",
            "url": "https://tribuneonlineng.com/senator-achonu-emerges-lp-guber-candidate-in-imo/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T06:22:31+00:00"
        },
        {
            "author": "Sandra Nwaokolo",
            "title": "Hakimi: Wife more important than mother, sister in marriage — Father Oluoma",
            "description": "Tribune OnlineHakimi: Wife more important than mother, sister in marriage — Father OluomaRenowned Nigerian Catholic priest, Rev Fr Chinenye Oluoma, has expressed his opinion on the divorce saga of Paris Saint-Germain (PSG) defender, Achraf Hakimi. In a post on his verified Facebook page on Saturday, the cleric advised that a wife should be considered the most important person in a marriage, even more than one&#8217;s mother or [&#8230;]Hakimi: Wife more important than mother, sister in marriage — Father OluomaTribune Online",
            "url": "https://tribuneonlineng.com/hakimi-wife-more-important-than-mother-sister-in-marriage-father-oluoma/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T06:12:18+00:00"
        },
        {
            "author": "Udeme Utip",
            "title": "Supplementary poll: INEC cancels Ikono/Ini Federal Constituency rerun over violence",
            "description": "Tribune OnlineSupplementary poll: INEC cancels Ikono/Ini Federal Constituency rerun over violenceThe Independent National Electoral Commission (INEC) has cancelled the rerun National Assembly election in Ikono/Ini Federal Constituency, Akwa Ibom due to wide spread violence. The Resident Electoral Commissioner (REC) in Akwa Ibom, Dr Cyril Omorogbe, disclosed this to newsmen in his office in Uyo on Saturday shortly after the election describing the exercise in the [&#8230;]Supplementary poll: INEC cancels Ikono/Ini Federal Constituency rerun over violenceTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-poll-inec-cancels-ikono-ini-federal-constituency-rerun-over-violence/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T06:10:49+00:00"
        },
        {
            "author": "Segun Adebayo",
            "title": "Oludare Jacob completes work on new creative work, picks release date",
            "description": "Tribune OnlineOludare Jacob completes work on new creative work, picks release dateThere are not many creative personalities like Oludare Taiye Jacob in the creative industry. Famous as “Enargy” and “Mr. Confidence”,  his new works seem to be another blockbuster projects that will put him on a new pedestal. The young man, who continues to shine in an industry that is populated by different talented individuals, said [&#8230;]Oludare Jacob completes work on new creative work, picks release dateTribune Online",
            "url": "https://tribuneonlineng.com/oludare-jacob-completes-work-on-new-creative-work-picks-release-date/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T02:46:15+00:00"
        },
        {
            "author": null,
            "title": "How to Mix and Match Pillows on a Sofa",
            "description": "Blend together pillows of different sizes, shapes, patterns, and textures on your sofa with these simple stepsYou’ve got your living room painted, a rug hugging the floor, art adorning the walls, but your couch is still bare. Mixing and matching throw pillows is a great way to bring your room together, but where do you begin when there are so many shapes, patterns, and textures? Whether you’re moving into a new place or simply freshening up your living room, we’ve got all the styling tips you need to combine your pillows for a chic, cohesive look. Read on to get mixing and matching!",
            "url": "https://www.wikihow.com/Mix-and-Match-Pillows-on-a-Sofa",
            "source": "This Day",
            "image": "https://www.wikihow.com/images/thumb/9/9b/Mix-and-Match-Pillows-on-a-Sofa-Step-1.jpg/v4-200px-Mix-and-Match-Pillows-on-a-Sofa-Step-1.jpg",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-16T00:00:00+00:00"
        },
        {
            "author": "Caroline Ceniza-Levine, Senior Contributor",
            "title": "3 Rules To Find The Career Advice You Can Actually Use",
            "description": "If you find yourself distracted by a tantalizing headline that promises the career magic bullet that will solve all your problems, bookmark it for a later time. Then prioritize your reading list with these three rules",
            "url": "https://www.forbes.com/sites/carolinecenizalevine/2023/04/15/3-rules-to-find-the-career-advice-you-can-actually-use/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643b14ebd03f83bed10ab186/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T21:25:39+00:00"
        },
        {
            "author": "Atiku Galadima",
            "title": "Supplementary poll: Bomai clinches Yobe South senatorial seat",
            "description": "Tribune OnlineSupplementary poll: Bomai clinches Yobe South senatorial seatSenator Ibrahim Bomai of All Progressives Congress (APC) has been declared winner of Yobe South senatorial election. Earlier, INEC had declared the Feb 25 election inconclusive following the cancellation of the Polling Unit 003 results in Manawaci in Fika Local Government Area leading rerun. Dr Abatcha Melemi of the federal university Gashua who is the [&#8230;]Supplementary poll: Bomai clinches Yobe South senatorial seatTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-poll-bomai-clinches-yobe-south-senatorial-seat/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T20:59:30+00:00"
        },
        {
            "author": "Michael Ovat",
            "title": "Ballot box snatching, missing result sheets mar Anambra supplementary election",
            "description": "Tribune OnlineBallot box snatching, missing result sheets mar Anambra supplementary electionSnatching of ballot boxes by thugs and missing results sheets characterised the conduct of the supplementary election for the Ogbaru federal constituency, Anambra state. Thugs suspected to be working for one of the leading political parties in the State were believed to be behind the snatching of the ballot boxes at polling units 021 and [&#8230;]Ballot box snatching, missing result sheets mar Anambra supplementary electionTribune Online",
            "url": "https://tribuneonlineng.com/ballot-box-snatching-missing-result-sheets-mar-anambra-supplementary-election/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T20:43:40+00:00"
        },
        {
            "author": "Amaechi Okonkwo",
            "title": "Voter apathy mars Rivers supplementary election",
            "description": "Tribune OnlineVoter apathy mars Rivers supplementary electionVoter apathy marred Saturday&#8217;s supplementary election at the Port Harcourt Federal Constituency II in Rivers State, this is as stakeholders have commended security agencies and the Independent National Electoral Commission INEC at the same exercise at the Khana/Gokana Constituency. Turnout for the House of Representatives supplementary election in affected LGA Port Harcourt City, was not [&#8230;]Voter apathy mars Rivers supplementary electionTribune Online",
            "url": "https://tribuneonlineng.com/voter-apathy-mars-rivers-supplementary-election/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T20:28:05+00:00"
        },
        {
            "author": "Godwin Otang",
            "title": "5 die, 24 injured as fire razes shops in Cross River",
            "description": "Tribune Online5 die, 24 injured as fire razes shops in Cross RiverA midnight fire has razed 10 Shops at Ugep Market, Central Cross River State on Saturday, April 15th. Sources confirm to our correspondent that the cause of the fire is yet unknown but that it destroyed 10 Shops containing goods worth millions. One of the residents at the scene, Mr Eyong Sunday, expressed disappointment in [&#8230;]5 die, 24 injured as fire razes shops in Cross RiverTribune Online",
            "url": "https://tribuneonlineng.com/5-die-24-injured-as-fire-razes-shops-in-cross-river/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T20:17:51+00:00"
        },
        {
            "author": "Kola Oyelere",
            "title": "Supplementary polls: 3 fear dead, 3 houses set ablaze in Kano",
            "description": "Tribune OnlineSupplementary polls: 3 fear dead, 3 houses set ablaze in KanoThree persons allegedly fear dead in Wudil town during a supplementary election, when some political thugs invaded a polling unit in the area on Saturday. It was also stated that during the alleged attack by the political thugs, resident of the area restricted the attack, and this also led to the setting ablaze of no [&#8230;]Supplementary polls: 3 fear dead, 3 houses set ablaze in KanoTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-polls-3-fear-dead-3-houses-set-ablaze-in-kano/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T20:03:56+00:00"
        },
        {
            "author": "Dan Pontefract, Contributor",
            "title": "Deloitte Research Suggests Leaders Had Better Wake Up And Be More Human",
            "description": "The workforce is a source of tremendous innovation, value, and energy, if only leaders were able to tap into their ability to be more human with team members.",
            "url": "https://www.forbes.com/sites/danpontefract/2023/04/15/deloitte-research-suggests-leaders-had-better-wake-up-and-be-more-human/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643afd3a9a67ce6c69a5f808/0x0.jpg?width=960&precrop=1618%2C909%2Cx0%2Cy71",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T19:48:41+00:00"
        },
        {
            "author": "Kola Oyelere",
            "title": "2 arrested over alleged blasphemy against Prophet Muhammad in Kano",
            "description": "Tribune Online2 arrested over alleged blasphemy against Prophet Muhammad in KanoThe Kano State Commissioner of Religious Affairs, Dr Muhammad Nazifi Bichi has said that the Department of State Services (DSS) has arrested two people, Baffa Hotoro and Habib Haroun, over alleged blasphemous statements they uttered against the personality of Noble Prophet Muhammad. (PBUH). According to Dr.Bichi, who confirmed it on Saturday while speaking with pressmen [&#8230;]2 arrested over alleged blasphemy against Prophet Muhammad in KanoTribune Online",
            "url": "https://tribuneonlineng.com/2-arrested-over-alleged-blasphemy-against-prophet-muhammad-in-kano/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T19:32:27+00:00"
        },
        {
            "author": "Eli Amdur, Contributor",
            "title": "Amidst A Job Boom, Tech Jobs Take Big Hit",
            "description": "Tech’s loss of 170 thousand jobs so far this year represents 14% of the jobs created in the same period of time.",
            "url": "https://www.forbes.com/sites/eliamdur/2023/04/15/amidst-a-job-boom-tech-jobs-take-big-hit/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643aedc551ee8eed2ea00895/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T18:38:05+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "Kogi 2023: Support me to consolidate Yahaya Bello’s gains, Ododo tells APC stakeholders",
            "description": "Tribune OnlineKogi 2023: Support me to consolidate Yahaya Bello&#8217;s gains, Ododo tells APC stakeholdersThe gubernatorial candidate of the All Progressives Congress (APC) for November 2023 poll in Kogi, Hon Ahmed Ododo Usman has called all the stakeholders of the party to join hands with him for collective victory in the forthcoming election. He made the call in a statement signed by Onogwu Muhammed and forwarded to TRIBUNE ONLINE [&#8230;]Kogi 2023: Support me to consolidate Yahaya Bello&#8217;s gains, Ododo tells APC stakeholdersTribune Online",
            "url": "https://tribuneonlineng.com/support-me-to-consolidate-bellos-gains-ododo-tells-stakeholders/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T18:36:23+00:00"
        },
        {
            "author": "Sikiru Obarayese",
            "title": "WEEK BRIEF: Peter Obi’s UK arrest, Banana Island building collapse, Tinubu ‘drug trafficking’ forfeiture… other top news",
            "description": "Tribune OnlineWEEK BRIEF: Peter Obi’s UK arrest, Banana Island building collapse, Tinubu &#8216;drug trafficking&#8217; forfeiture… other top newsSikiru Obarayese writes on major stories that generated debates across the country last week. The United Kingdom government has responded to NIGERIAN TRIBUNE’s inquiry on the arrest and detention of Labour Party (LP) presidential candidate, Peter Obi. NIGERIAN TRIBUNE on Wednesday, April 12 wrote the United Kingdom government requesting the details of the arrest and detention [&#8230;]WEEK BRIEF: Peter Obi’s UK arrest, Banana Island building...",
            "url": "https://tribuneonlineng.com/week-brief-peter-obis-uk-arrest-banana-island-building-collapse-tinubu-drug-trafficking-forfeiture-other-top-news/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T18:28:02+00:00"
        },
        {
            "author": "Sikiru Obarayese",
            "title": "Peter Obi’s arrest: We don’t comment on individual cases, UK govt replies NIGERIAN TRIBUNE",
            "description": "Tribune OnlinePeter Obi&#8217;s arrest: We don&#8217;t comment on individual cases, UK govt replies NIGERIAN TRIBUNEThe United Kingdom government has responded to NIGERIAN TRIBUNE’s enquire on the arrest and detention of Labour Party (LP) presidential candidate, Peter Obi. NIGERIAN TRIBUNE on Wednesday, April 12 wrote the United Kingdom government requesting the details of the arrest and detention of Peter Obi, by its immigration officials at Heathrow airport in London last [&#8230;]Peter Obi&#8217;s arrest: We don&#8217;t comment on individual cases, UK govt replies NIGERIAN TRIBUNETribune...",
            "url": "https://tribuneonlineng.com/peter-obis-arrest-we-dont-comment-on-individual-cases-uk-govt-replies-nigerian-tribune/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T18:01:43+00:00"
        },
        {
            "author": "Ishola Michael",
            "title": "Bauchi: Come back to APC now, group tells NNPP’s Jika",
            "description": "Tribune OnlineBauchi: Come back to APC now, group tells NNPP&#8217;s JikaHaving failed to achieve his gubernatorial ambition which forced him out of the ruling All Progressives Congress (APC) to the New Nigeria Peoples Party (NNPP), Sen Halliru Dauda Jika has been urged to retrace his path back to the fold of the party. The call was made by a group known as the &#8216;APC Faithful [&#8230;]Bauchi: Come back to APC now, group tells NNPP&#8217;s JikaTribune Online",
            "url": "https://tribuneonlineng.com/bauchi-come-back-to-apc-now-group-tells-nnpps-jika/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T17:53:51+00:00"
        },
        {
            "author": "Ebiowei Lawal",
            "title": "Ex-Minister, Sylva wins Bayelsa APC guber ticket",
            "description": "Tribune OnlineEx-Minister, Sylva wins Bayelsa APC guber ticketThe immediate past Minister of State for Petroleum Resources, Chief Timipre Sylva, has emerged the candidate of the All Progressives Congress (APC) for the November 11th, 2023 governorship election in Bayelsa. Sylva, who was declared winner after the party&#8217;s primary election which was conducted on Friday across the 105 wards of the state defeated six [&#8230;]Ex-Minister, Sylva wins Bayelsa APC guber ticketTribune Online",
            "url": "https://tribuneonlineng.com/ex-minister-sylva-wins-bayelsa-apc-guber-ticket/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T17:39:15+00:00"
        },
        {
            "author": "Kola Oyelere",
            "title": "Supplementary election: NNPP’s Kadage clinches Kano Assembly seat",
            "description": "Tribune OnlineSupplementary election: NNPP’s Kadage clinches Kano Assembly seatThe independent National Electoral Commission INEC has declared New Nigeria People Party (NNPP) candidate, Murtala Kadage winner of the Garko Local Government State Assembly supplementary election. It be recalled the INEC returning officer Sani Safiyanu in the previous election has declared that Kadage Muhammad of the NNPP winner Having satisfied the requirements of the law [&#8230;]Supplementary election: NNPP’s Kadage clinches Kano Assembly seatTribune Online",
            "url": "https://tribuneonlineng.com/supplementary-election-nnpps-kadage-clinches-kano-assembly-seat/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T17:31:54+00:00"
        },
        {
            "author": "Olakunle Moroof",
            "title": "African Bar Association slams INEC over conduct of supplementary elections",
            "description": "Tribune OnlineAfrican Bar Association slams INEC over conduct of supplementary electionsThe President of African Bar Association, Barrister Hannibal Uwaifo, has knocked Independent National Electoral Commission on the conduct of the supplementary elections in Sokoto. He said the INEC has spent so much time in its preparation for the polls only to produce nothing at the end of the day. He said the institution and not [&#8230;]African Bar Association slams INEC over conduct of supplementary electionsTribune Online",
            "url": "https://tribuneonlineng.com/african-bar-association-slams-inec-over-conduct-of-supplementary-elections/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T17:22:57+00:00"
        },
        {
            "author": "Joseph Inokotong",
            "title": "Nigeria’s inflation hits highest in 17 years",
            "description": "Tribune OnlineNigeria&#8217;s inflation hits highest in 17 yearsInflation rate in Nigeria rose to 22.04 percent in March 2023, showing an increase of 0.13 percent points when compared to February 2023 headline inflation rate which was 21.91 percent. This is according to the recent Consumer Price Index (CPI) report released by the National Bureau of Statistics (NBS) on Saturday, and it shows that [&#8230;]Nigeria&#8217;s inflation hits highest in 17 yearsTribune Online",
            "url": "https://tribuneonlineng.com/nigerias-inflation-hits-highest-in-17-years/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T17:15:12+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Kogi 2023: APC special congress ratifies Ododo’s candidacy",
            "description": "Tribune OnlineKogi 2023: APC special congress ratifies Ododo&#8217;s candidacyThe candidature of Ahmed Usman Ododo as the flag-bearer of the All Progressives Congress in the Kogi State governorship election, scheduled for November 11, has been ratified by a special Congress of the party, as stipulated in the guidelines for the primary election, which held on Friday. The special congress, presided over by the Chairman [&#8230;]Kogi 2023: APC special congress ratifies Ododo&#8217;s candidacyTribune Online",
            "url": "https://tribuneonlineng.com/kogi-2023-apc-special-congress-ratifies-ododos-candidacy/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T17:08:49+00:00"
        },
        {
            "author": "Idahosa Moses",
            "title": "Political thuggery, intimidation, low turnout mar INEC supplementary election in Edo",
            "description": "Tribune OnlinePolitical thuggery, intimidation, low turnout mar INEC supplementary election in EdoPolitical thuggery, intimidation, and low voter turnout on Saturday characterised the Independent National Electoral Commission (INEC) Supplementary Elections in Edo. TRIBUNE ONLINE reports the elections, conducted across some areas in Egor, Oredo East, Ovia South West for the house of assembly, and Orhionmwon/Uhunmonde federal constituency, commenced between 8:30 am and 9 am with few electorates [&#8230;]Political thuggery, intimidation, low turnout mar INEC supplementary election in EdoTribune...",
            "url": "https://tribuneonlineng.com/political-thuggery-intimidation-low-turnout-mar-inec-supplementary-election-in-edo/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:45:45+00:00"
        },
        {
            "author": "Clement Idoko",
            "title": "Shi’ites: Lawyer drags El-Rufai to ICC over alleged genocide",
            "description": "Tribune OnlineShi&#8217;ites: Lawyer drags El-Rufai to ICC over alleged genocideAn Abuja-based legal practitioner, Bala Dakum, has petitioned the International Criminal Court (ICC), seeking investigation and prosecution of Governor Nasir El-Rufai of Kaduna over alleged genocide against the Shi&#8217;ites Muslim Sect in the state. While addressing newsmen on Saturday in Abuja, Dakum, said a petition has already been written to the ICC to that effect. [&#8230;]Shi&#8217;ites: Lawyer drags El-Rufai to ICC over alleged genocideTribune Online",
            "url": "https://tribuneonlineng.com/shiites-lawyer-drags-el-rufai-to-icc-over-alleged-genocide/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:36:10+00:00"
        },
        {
            "author": "Kazeem Biriowo",
            "title": "Add health to exclusive budget list, WHO urges FG",
            "description": "Tribune OnlineAdd health to exclusive budget list, WHO urges FGThe World Health Organisation (WHO) has called on Nigeria government to add health to Exclusive budget list. The WHO Country Representative, Dr Walter Kazadi Molumbo while interacting with journalists on Saturday at the &#8220;Walk the Talk&#8221; exercise to commemorate 75th anniversary of WHO, opined that if government adds health to Exclusive budget list, it will [&#8230;]Add health to exclusive budget list, WHO urges FGTribune Online",
            "url": "https://tribuneonlineng.com/add-health-to-exclusive-budget-list-who-urges-fg/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:27:36+00:00"
        },
        {
            "author": "Susan Harmeling, Contributor",
            "title": "The Great Generational Mashup: How \"Productive Friction\" Can Ignite Innovation And Unlock The Power Of An Age-Diverse Workforce",
            "description": "Generational diversity has emerged as a powerful force affecting the way we work, communicate, and innovate in the 21st-century.",
            "url": "https://www.forbes.com/sites/susanharmeling/2023/04/15/the-great-generational-mashup-how-productive-friction-can-ignite-innovation-and-unlock-the-power-of-an-age-diverse-workforce/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643acfadee57a8ed960ab188/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:27:32+00:00"
        },
        {
            "author": "Taiwo Amodu",
            "title": "Kogi APC Primary: Smart Adeyemi, Audu, Oseni, others reject outcome",
            "description": "Tribune OnlineKogi APC Primary: Smart Adeyemi, Audu, Oseni, others reject outcomeSome of the aspirants who participated in last Friday&#8217;s All Progressives Congress governorship primary in Kogi where the former Auditor General for Local Governments in Kogi, Ahmed Usman Ododo, was declared winner have rejected the outcome of the process. The secretary of the Kogi State APC Primary Election Committee, Hon. Patrick Obahiagbon, on behalf of [&#8230;]Kogi APC Primary: Smart Adeyemi, Audu, Oseni, others reject outcomeTribune Online",
            "url": "https://tribuneonlineng.com/kogi-apc-primary-smart-adeyemi-audu-oseni-others-reject-outcome/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:17:11+00:00"
        },
        {
            "author": "Christine Comaford, Contributor",
            "title": "The Evolution Of Success: How To Manage And Excel In Business Transformations",
            "description": "Your business is transforming right, whether you know it or not.",
            "url": "https://www.forbes.com/sites/christinecomaford/2023/04/15/the-evolution-of-success-how-to-manage-and-excel-in-business-transformations/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/62fe40baadccff017f1dbcbd/0x0.jpg",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:11:33+00:00"
        },
        {
            "author": "Nurudeen Alimi",
            "title": "Shun gossip, backbiting after Ramadan, Islamic women group urges Muslims",
            "description": "Tribune OnlineShun gossip, backbiting after Ramadan, Islamic women group urges MuslimsAn Islamic women&#8217;s group, Sisters of Jannah, Ibadan Zone, has called on its members and Muslims generally to shun gossip and backbiting during Ramadan and after. Speaking during an iftar hosted by one of its members, sister Nurat Oyewumi Suleiman, at her residence in Ibadan, the Oyo State recently, the Zonal Coordinator, Alhaja Khadijah Olatorera [&#8230;]Shun gossip, backbiting after Ramadan, Islamic women group urges MuslimsTribune Online",
            "url": "https://tribuneonlineng.com/shun-gossip-backbiting-after-ramadan-islamic-women-group-urges-muslims/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:10:05+00:00"
        },
        {
            "author": "Joan Michelson, Contributor",
            "title": "‘Women Are Economic Engines Of Growth’ Melinda Gates At Mastercard Inclusive Growth Summit",
            "description": "Women’s economic parity would add $12 trillion to the global economy, according to the World Economic Forum. Melinda French Gates, Trevor Noah & other speakers explained at the Mastercard Global Inclusive Growth Summit what it will take to seize the opportunity of women's massive economic power.",
            "url": "https://www.forbes.com/sites/joanmichelson2/2023/04/15/women-are-economic-engines-of-growth-melinda-gates-at-mastercard-inclusive-growth-summit/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643ac532b749cf6bf46b19cc/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:04:00+00:00"
        },
        {
            "author": "'Yomi Ayeleso",
            "title": "Ekiti varsity presents 33 new programs to NUC for accreditation",
            "description": "Tribune OnlineEkiti varsity presents 33 new programs to NUC for accreditationThe management of the Bamidele Olumilua University of Education, Science and Technology Ikere-Ekiti (BOUESTI) has presented before the visiting National University Commission (NUC) team thirty-three new programmes for accreditation in the institution. Speaking while playing host to the NUC resource verification team, the vice chancellor of BOUESTI, Professor Victor Adeoluwa noted that the institution since [&#8230;]Ekiti varsity presents 33 new programs to NUC for accreditationTribune Online",
            "url": "https://tribuneonlineng.com/ekiti-varsity-presents-33-new-programs-to-nuc-for-accreditation/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T16:00:15+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Kogi Guber: Julius Elukpo wins ADP primary election",
            "description": "Tribune OnlineKogi Guber: Julius Elukpo wins ADP primary electionAn Elderstateman and legal luminary, Barrister Julius Elukpo, PHD, has emerged winner of the Action Democratic Party (ADP) Primary election held in Lokoja on Friday. The election adopted a consensus model, as other interested Aspirants withdrew for Barrister Julius Elukpo, citing his impeccable character and competence to change the narrative of the state as their [&#8230;]Kogi Guber: Julius Elukpo wins ADP primary electionTribune Online",
            "url": "https://tribuneonlineng.com/kogi-guber-julius-elukpo-wins-adp-primary-election/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T15:55:07+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Ex-Gov Makarfi heads PDP committee for Kogi primary election",
            "description": "Tribune OnlineEx-Gov Makarfi heads PDP committee for Kogi primary electionThe National Working Committee of the Peoples Democratic Party (PDP) has constituted a special committee to conduct the primary election for aspirants ahead of the November governorship election in Kogi State. The PDP primary will be held on Sunday in the Lokoja township stadium. The National Organising Secretary of the PDP, Umar Bature, made the [&#8230;]Ex-Gov Makarfi heads PDP committee for Kogi primary electionTribune Online",
            "url": "https://tribuneonlineng.com/ex-gov-makarfi-heads-pdp-committee-for-kogi-primary-election/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T15:49:45+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Natasha Akpoti-Uduaghan involved in auto crash on Abuja-Lokoja highway",
            "description": "Tribune OnlineNatasha Akpoti-Uduaghan involved in auto crash on Abuja-Lokoja highwayNatasha Akpoti-Uduaghan, the Kogi Central Senatorial candidate of the Peoples Democratic Party (PDP) in the February 25th general election, was involved in a ghastly motor accident on the Abuja-Lokoja highway. The accident occurred on Friday while she was on her way to Abuja and was to return to Lokoja for the Sunday governorship primary. According [&#8230;]Natasha Akpoti-Uduaghan involved in auto crash on Abuja-Lokoja highwayTribune Online",
            "url": "https://tribuneonlineng.com/natasha-akpoti-uduaghan-involved-in-auto-crash-on-abuja-lokoja-highway/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T15:45:06+00:00"
        },
        {
            "author": "Isaac Shobayo",
            "title": "Plateau Central: INEC declares Diket Plang Senator-elect",
            "description": "Tribune OnlinePlateau Central: INEC declares Diket Plang Senator-electAfter nine weeks of anticipation, the Independent National Electoral Commission (INEC) has announced Hon Diket Plang of the All Progressive Congress (APC) as the winner of the Plateau Central senatorial election. The result was declared by INEC Returning Officer Dr Jima Lar on Saturday in Pankshin, the headquarters of the Plateau Central Senatorial Zone. According [&#8230;]Plateau Central: INEC declares Diket Plang Senator-electTribune Online",
            "url": "https://tribuneonlineng.com/plateau-central-inec-declares-diket-plang-senator-elect/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T15:36:29+00:00"
        },
        {
            "author": "Yekini Jimoh",
            "title": "Kogi guber: Leading our party to victory difficult task — APC candidate",
            "description": "Tribune OnlineKogi guber: Leading our party to victory difficult task — APC candidateThe elected All Progressive Congress (APC) Kogi state governorship candidate, Alhaji Ahmed Ododo Usman has said that the task of leading his Party to victory in the next governorship election in the state is a herculean one but it is a task they must accomplish by the grace of God. He made this known on [&#8230;]Kogi guber: Leading our party to victory difficult task — APC candidateTribune Online",
            "url": "https://tribuneonlineng.com/kogi-guber-leading-our-party-to-victory-difficult-task-apc-candidate/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T15:30:19+00:00"
        },
        {
            "author": "Israel Arogbonlo",
            "title": "Man stabs wife to death during fight in Delta",
            "description": "Tribune OnlineMan stabs wife to death during fight in DeltaIt was a tragic end as a popular butcher reportedly stabbed his wife to death in Warri, Delta following a heated argument. The incident, TRIBUNE ONLINE gathered happened on Thursday evening, April 13, 2023. The suspect, according to sources, tried to scoop hot water to bathe, after he returned home from Igbudu market where he [&#8230;]Man stabs wife to death during fight in DeltaTribune Online",
            "url": "https://tribuneonlineng.com/man-stabs-wife-to-death-during-fight-in-delta/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T14:59:46+00:00"
        },
        {
            "author": "Ifedayo Ogunyemi",
            "title": "CISLAC kicks, says ‘political’ conviction of Kwara journalists unacceptable",
            "description": "Tribune OnlineCISLAC kicks, says &#8216;political&#8217; conviction of Kwara journalists unacceptableCivil Society Legislative Advocacy Centre (CISLAC), a civil society organisation, has condemned the recent conviction of Nigerian journalists, Gidado Yushau and Alfred Olufemi, over a 2018 publication that exposed the illegal activities of Hillcrest Agro-Allied company, which is linked to President Muhammadu Buhari&#8217;s Economic Adviser, Sarah Alade. CISLAC described the verdict as a political move [&#8230;]CISLAC kicks, says &#8216;political&#8217; conviction of Kwara journalists...",
            "url": "https://tribuneonlineng.com/cislac-kicks-says-political-conviction-of-kwara-journalists-unacceptable/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T14:42:02+00:00"
        },
        {
            "author": "Grace Egbo",
            "title": "Ebonyi Rerun: INEC denying us our voting right, Voters allege",
            "description": "Tribune OnlineEbonyi Rerun: INEC denying us our voting right, Voters allegeRegistered voters in Abakaliki North Constituency, Ebonyi State, have expressed concerns over alleged disenfranchisement by the Independent National Electoral Commission (INEC). The voters made the claims at the Achi/Udemezue polling unit 019, where they were expected to cast their votes for their preferred candidates. According to the voters, they were originally registered to vote at [&#8230;]Ebonyi Rerun: INEC denying us our voting right, Voters allegeTribune Online",
            "url": "https://tribuneonlineng.com/ebonyi-rerun-inec-denying-us-our-voting-right-voters-allege/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T14:02:26+00:00"
        },
        {
            "author": "Dr. Gleb Tsipursky, Contributor",
            "title": "12 Strategies To Defeat Cognitive Biases And Boost Your Bottom Line",
            "description": "Falling for the dangerous judgment errors called cognitive biases often costs you an arm and a leg. Yet such serious mistakes happen all the time in business!",
            "url": "https://www.forbes.com/sites/glebtsipursky/2023/04/15/12-strategies-to-defeat-cognitive-biases-and-boost-your-bottom-line/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/643aad2aece31c740e0ab186/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T13:58:41+00:00"
        },
        {
            "author": "Ebenezer Adurokiya",
            "title": "Reps member felicitates APC chieftain on conferment of chieftaincy title",
            "description": "Tribune OnlineReps member felicitates APC chieftain on conferment of chieftaincy titleThe 2023 House of Representatives candidate of the All Progressives Congress (APC) for Bomadi and Patani Federal Constituency, Delta State, Hon. Tamarankro Obriki, has congratulated High Chief Michael Johnny on the chieftaincy title conferred on him by the traditional ruler of Gbaramatu Kingdom, in Warri South West Local Government Area of Delta State. Johnny, Ijaw [&#8230;]Reps member felicitates APC chieftain on conferment of chieftaincy titleTribune Online",
            "url": "https://tribuneonlineng.com/reps-member-felicitates-apc-chieftain-on-conferment-of-chieftaincy-title/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T13:55:13+00:00"
        },
        {
            "author": "Tribune Online",
            "title": "Kingsley Ogga remains expelled, no longer Kogi ADC Chairman — Reps member ",
            "description": "Tribune OnlineKingsley Ogga remains expelled, no longer Kogi ADC Chairman — Reps member Leke Abejide, a member representing Yagba East/West/Mopamuro constituency in the House of Representatives has called on the Nigerian Police, Department of State Security (DSS) and other security agencies to disregard a Federal High Court judgement retaining Kingsley Ogga as the chairman of the Action Democratic Congress (ADC) in Kogi State. According to him, the expulsion [&#8230;]Kingsley Ogga remains expelled, no longer Kogi ADC Chairman — Reps member Tribune Online",
            "url": "https://tribuneonlineng.com/kingsley-ogga-remains-expelled-no-longer-kogi-adc-chairman-reps-member/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T13:27:25+00:00"
        },
        {
            "author": "Rotimi Ige",
            "title": "MultiChoice unveils new reality show for ex-BBNaija housemate, Beauty Tukura",
            "description": "Tribune OnlineMultiChoice unveils new reality show for ex-BBNaija housemate, Beauty TukuraMultiChoice Nigeria, the leading entertainment provider in Africa, has announced the launch of a new reality TV show featuring ex-bbnaija housemate, Beauty Tukura, called &#8220;My Beautyful Life&#8221;. The show is set to debut on Monday, April 17, 2023, and will air on Africa Magic Showcase (DStv ch. 151). &#8216;My Beautyful Life&#8217; promises to take viewers [&#8230;]MultiChoice unveils new reality show for ex-BBNaija housemate, Beauty TukuraTribune Online",
            "url": "https://tribuneonlineng.com/multichoice-unveils-new-reality-show-for-ex-bbnaija-housemate-beauty-tukura/",
            "source": "tribune",
            "image": null,
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T12:16:42+00:00"
        },
        {
            "author": "Edward Segal, Senior Contributor",
            "title": "On 10th Anniversary Of Boston Marathon Bombing, Several Crisis Management Lessons Still Resonate",
            "description": "The response to the deadly explosions that rocked the Boston Marathon 10 years ago today yielded important lessons about managing a crisis that continue to resonate.",
            "url": "https://www.forbes.com/sites/edwardsegal/2023/04/15/on-10th-anniversary-of-boston-marathon-bombing-several-crisis-management-lessons-still-resonate/",
            "source": "Leadership",
            "image": "https://imageio.forbes.com/specials-images/imageserve/64394bcd7f66dfee170ab188/0x0.jpg?width=960",
            "category": "general",
            "language": "en",
            "country": "ng",
            "published_at": "2023-04-15T12:14:05+00:00"
        }
    ]
}